## Plan Result (pocket-event-bridge-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11332554012)



<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_event_rule.list-export-ready-event_PocketEventBridge-Prod-ListExportReady-EventBridge-Rule_event-bridge-rule_4DC64DAB
  * aws_cloudwatch_event_target.list-export-ready-event_PocketEventBridge-Prod-ListExportReady-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-ListExportReady-SNS-Target_98A65022
  * aws_cloudwatch_metric_alarm.list-export-ready-event_listexportready-rule-dlq-alarm_1E02E9DF
  * aws_sns_topic.list-export-ready-event_export-request-ready-topic_EFF593DF
  * aws_sns_topic_policy.list-export-ready-event_export-request-ready-sns-topic-policy_C84F2FC4
  * aws_sqs_queue.list-export-ready-event_sns-topic-dlq_AB69E6E9
  * null_resource.list-export-ready-event_null-resource_05DA8BBA



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.list-export-ready-event_PocketEventBridge-Prod-EventBridge-SNS-Policy_F6056A37 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "list-export-ready-event_PocketEventBridge-Prod-EventBridge-SNS-Policy_F6056A37" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.list-export-ready-event_PocketEventBridge-Prod-ListExportReady-EventBridge-Rule_event-bridge-rule_4DC64DAB will be created
  + resource "aws_cloudwatch_event_rule" "list-export-ready-event_PocketEventBridge-Prod-ListExportReady-EventBridge-Rule_event-bridge-rule_4DC64DAB" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "list-export-ready",
                ]
              + source      = [
                  + "account-data-deleter",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-ListExportReady-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags           = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_target.list-export-ready-event_PocketEventBridge-Prod-ListExportReady-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-ListExportReady-SNS-Target_98A65022 will be created
  + resource "aws_cloudwatch_event_target" "list-export-ready-event_PocketEventBridge-Prod-ListExportReady-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-ListExportReady-SNS-Target_98A65022" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "PocketEventBridge-Prod-ListExportReady-Rule-Rule"
      + target_id      = "PocketEventBridge-Prod-ListExportReady-SNS-Target"

      + dead_letter_config {
          + arn = (known after apply)
        }
    }

  # aws_cloudwatch_metric_alarm.list-export-ready-event_listexportready-rule-dlq-alarm_1E02E9DF will be created
  + resource "aws_cloudwatch_metric_alarm" "list-export-ready-event_listexportready-rule-dlq-alarm_1E02E9DF" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + alarm_description                     = "Number of messages >= 15"
      + alarm_name                            = "PocketEventBridge-Prod-ListExportReady-rule-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "PocketEventBridge-Prod-ListExportReady-SNS-Topic-Event-Rule-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + period                                = 900
      + statistic                             = "Sum"
      + tags_all                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + threshold                             = 15
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.list-export-ready-event_export-request-ready-topic_EFF593DF will be created
  + resource "aws_sns_topic" "list-export-ready-event_export-request-ready-topic_EFF593DF" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "PocketEventBridge-Prod-ListExportReady-Topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                    = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.list-export-ready-event_export-request-ready-sns-topic-policy_C84F2FC4 will be created
  + resource "aws_sns_topic_policy" "list-export-ready-event_export-request-ready-sns-topic-policy_C84F2FC4" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sqs_queue.list-export-ready-event_sns-topic-dlq_AB69E6E9 will be created
  + resource "aws_sqs_queue" "list-export-ready-event_sns-topic-dlq_AB69E6E9" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-ListExportReady-SNS-Topic-Event-Rule-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # null_resource.list-export-ready-event_null-resource_05DA8BBA will be created
  + resource "null_resource" "list-export-ready-event_null-resource_05DA8BBA" {
      + id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":823,"Program":"tfcmt","SHA1":"de3592aadca6d44d6c76f1cc47762425a413983d","Target":"pocket-event-bridge-cdk-production","Vars":{},"WorkflowName":"Pocket Event Bridge"} -->